title: DirectConnect Information Discovery
id: feaa9d99-436a-11ea-a446-611de37145b6
status: stable
description: Detects information discovery of DirectConnect components. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/26
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'directconnect.amazonaws.com'
        eventName|startswith: 'Describe' 
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized reads from known users/services
level: low