title: SQS Information Discovery
id: 065274bd-436b-11ea-aef6-ebc8957dabad
status: stable
description: Detects information discovery of SQS components. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/26
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'sqs.amazonaws.com'
        eventName|startswith: 'List' 
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized reads from known users/services
level: low