title: IAM GetAuthorizationDetails
id: 048cf66c-436b-11ea-aef6-c543da989390
status: stable
description: Detects when IAM GetAuthorizationDetails is called. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/IAM/latest/APIReference/API_GetAccountAuthorizationDetails.html
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/24
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'iam.amazonaws.com'
        eventName: 'GetAccountAuthorizationDetails'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized calls from known users/services
level: low