title: ECS Account Setting Changes
id: 05d7c62e-436b-11ea-91a6-5ba9314e7134
status: stable
description: Detects changes in ECS account settings. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/AmazonECS/latest/developerguide/ecs-account-settings.html
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/13
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'ecs.amazonaws.com'
        eventName: 
          - 'PutAccountSetting'
          - 'DeleteAccountSetting'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized changes from known users/services
level: low