title: EKS Cluster Changes
id: fbffefe2-436a-11ea-9da3-ff7ee68a3562
status: stable
description: Detects changes to EKS clusters including creation, deletion and modification. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/eks/latest/userguide/clusters.html
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/12
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'eks.amazonaws.com'
        eventName: 
          - 'CreateCluster'
          - 'DeleteCluster'
          - 'CreateAddon'
          - 'CreateFargateProfile'
          - 'CreateNodegroup'
          - 'UpdateAddon'
          - 'UpdateClusterConfig'
          - 'UpdateClusterVersion'
          - 'UpdateNodegroupConfig'
          - 'UpdateNodegroupVersion'
          - 'AssociateEncryptionConfig'
          - 'AssociateIdentityProviderConfig'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized changes to EKS Clusters from known users/services
level: low