title: CloudTrail EC2 RunInstances
id: 04f02503-436b-11ea-9b36-dbbbeeebad5e
status: stable 
description: Detects EC2 instances starting up filtering out the Autoscaling user. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_RunInstances.html
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/06/01
modified: 2023/09/08
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'ec2.amazonaws.com'
        eventName: 'RunInstances'
    filter:
        sourceIPAddress: 'autoscaling.amazonaws.com'
        userIdentity.arn|endswith: 'assumed-role/AWSServiceRoleForAutoScaling/AutoScaling'
    condition: selection and not filter
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives: 
    - Legitimate creation of EC2 instances
    - Service users other than AutoScaling making automated changes to EC2 instances
level: low