title: SSM Cancel Command
id: 092edfdd-436b-11ea-9da3-2103ab87a95f
status: stable
description: Detects when an SSM command is canceled. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/systems-manager/latest/APIReference/API_CancelCommand.html
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/10
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'ssm.amazonaws.com'
        eventName: 'CancelCommand'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized cancellations from known users/services
level: low