title: ELB Information Discovery
id: fe5ea02e-436a-11ea-9b36-fdf5b0e78ac9
status: stable
description: Detects information discovery of load balancer components. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/31
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'elasticloadbalancing.amazonaws.com'
        eventName|startswith: 'Describe'
    filter_1:
        userAgent: 
          - 'config.amazonaws.com'
          - 'ecs.amazonaws.com'
        userIdentity.arn|endswith: 
          - 'assumed-role/aws-controltower-ConfigRecorderRole/AWSConfig-Describe'
          - 'assumed-role/tf-tower-config-role/AWSConfig-Describe'
          - 'assumed-role/AWSServiceRoleForECS/ecs-service-scheduler'
    filter_2:
        userAgent: 'trustedadvisor.amazonaws.com'
        userIdentity.arn|endswith: 'assumed-role/AWSServiceRoleForTrustedAdvisor/TrustedAdvisor' 
    condition: selection and not (filter_1 or filter_2)
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized reads from known users/services
level: low