title: CloudTrail IAM Identity Center Group Changes
id: a9ab021c-c681-4808-9c74-82b4496ea360
status: test
description: Detects IAM Identity Center (formerly AWS SSO) group changes. Requires group ID correlation with the linked SSO service in the AWS Console. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/singlesignon/latest/IdentityStoreAPIReference/API_Operations.html
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/05/05
modified: 2023/07/18
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource:
            - 'sso-directory.amazonaws.com'
            - 'identitystore.amazonaws.com'
        eventName:
            - 'CreateGroup'
            - 'DeleteGroup'
            - 'UpdateGroup'
            - 'RemoveUserFromGroup'
            - 'AddUserToGroup'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Legitimate admin activity related to setting up or modifying new SSO linked groups.
level: low