title: CloudTrail SSM Resume Session 
id: 07e940bf-436b-11ea-880a-f90255555620
status: stable 
description: Alerts when a user resumes an SSM session.  Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
   - https://docs.aws.amazon.com/systems-manager/latest/APIReference/API_ResumeSession.html
author: Bria Atchley - SOC Analyst, F5 Inc
date: 2023/10/15
logsource: 
    product: aws 
    service: cloudtrail 
detection: 
    selection: 
        eventSource: 'ssm.amazonaws.com'
        eventName: 'ResumeSession'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized user changes in SSM
level: low