title: CloudTrail ELB Rule Changes
id: 0292ad60-436b-11ea-aef6-c7409f4e267c
status: stable
description: Detects load balancer rule changes. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/elasticloadbalancing/latest/APIReference/API_CreateRule.html
    - https://docs.aws.amazon.com/elasticloadbalancing/latest/APIReference/API_DeleteRule.html
    - https://docs.aws.amazon.com/elasticloadbalancing/latest/APIReference/API_ModifyRule.html
    - https://docs.aws.amazon.com/elasticloadbalancing/latest/APIReference/API_SetRulePriorities.html
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/06/09
modified: 2023/07/18
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'elasticloadbalancing.amazonaws.com'
        eventName: 
            - 'CreateRule'
            - 'DeleteRule'
            - 'ModifyRule'
            - 'SetRulePriorities'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Legitimate changes to ELB rules
level: low