title: Sysmon - Driver Loaded with Valid Signature
id: 2193235a-7e6c-11ea-8c41-1d158416c0bc
status: stable
description: Detects when a driver is loaded with a valid digital signature. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90006
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/11/06
logsource:
    product: windows
    category: driver_loaded
detection:
    selection:
        EventId: 6
        SignatureStatus: 'Valid'
    condition: selection
fields:
  - Signed
  - ImageLoaded
  - Signature
  - SignatureStatus
falsepositives:
    - Installation of trusted and known drivers
level: medium