title: Linux Connection to Potential Out-Of-Band Interaction Site
id: 43af496d-1332-4a3a-9a02-64f911e33550
status: test
description: Detects connections to out-of-band interaction sites such as interact.sh or Burp Collaborator which can be used to discover vulnerabilities in web applications or potentially exfiltrate sensitive data. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/06/15
logsource:
    product: linux
    category: network_connection
detection:
    selection:
        DestinationHostname|endswith:
            - '.interact.sh'
            - '.dnslog.cn'
            - '.requestbin.net'
            - '.canarytokens.com'
            - '.burpcollaborator.net'
            - '.oastify.com'
            - '.oast.pro'
            - '.oast.live'
            - '.oast.site'
            - '.oast.online'
            - '.oast.fun'
            - '.oast.me'
    condition: selection
fields:
    - Image
    - DestinationHostname
    - CommandLine
falsepositives:
    - Authorized pentest activity
level: high