title: Linux Connection To Telegram API Domain
id: 6b14adb5-5dfc-4dc4-8e49-a8fce8b94934
status: test
description: This rule alerts on connections to the Telegram API domain. Threat actors have been observed using the Telegram API to exfiltrate data. This rule requires that eBPF be enabled on the agent. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/05/05
modified: 2023/05/30
logsource:
    product: linux
    category: network_connection
detection:
    selection:
        DestinationHostname: 'api.telegram.org'
    condition: selection
fields:
    - User
    - Image
    - CommandLine
    - DestinationHostname
falsepositives: 
    - Legitimate connections to the Telegram API such as user notifications.
level: high