title: Security Group Management Members Modified in Global Group
id: 0c486421-7e6c-11ea-8c41-87b7b3f7c147
status: stable
description: Detects when a user is added or removed from a security-enabled global group. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/audit-security-group-management
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/09/27
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID:
            - 4728 # Member added
            - 4729 # Member removed
    condition: selection
fields:
    - TargetUserName 
    - TargetDomainName
    - MemberName
    - MemberSid
    - SubjectUserName
    - SubjectDomainName
falsepositives:
    - Authorized users adding and removing users from security enabled groups
level: medium