title: User Account Was Locked
id: 35300b41-7e6c-11ea-8c41-37518a21e6a9
status: stable
description: Detects when a user account is locked. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4740
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/09/20
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 4740
    condition: selection
fields:
    - TargetUserName
    - TargetDomainName
    - SubjectDomainName
    - SubjectUserName
falsepositives:
    - Lockouts due to legitimate users forgetting their password
    - Admin users locking inactive accounts
level: medium