title: Sysmon Registry Value Modification
id: 3141e043-7e6c-11ea-804f-6b2207156ab0
status: stable
description: Detects when a registry value is modified. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90013
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/11/16
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        EventId: 13
    condition: selection
fields:
    - User
    - Image
    - TargetObject
    - Details
falsepositives:
    - Expected modification of registry keys.
level: medium