title: EKS Information Discovery
id: 042d7154-436b-11ea-b0d8-8f5ef5d7e9b1
status: stable
description: Detects information discvoery of EKS components. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/26
modified: 2023/12/11
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'eks.amazonaws.com'
        eventName: 
            - 'ListClusters'
            - 'DescribeCluster'
    filter:
        userAgent: 'config.amazonaws.com'
        userIdentity.arn|endswith: 
            - 'assumed-role/aws-controltower-ConfigRecorderRole/ConfigResourceCompositionSession'
            - 'assumed-role/tf-tower-config-role/ConfigResourceCompositionSession'
    condition: selection and not filter
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized reads from known users/services
level: low