title: IAM Information Discovery
id: 046968c3-436b-11ea-9da3-4f3acf4bfb6f
status: stable
description: Detects information discovery of IAM components. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/26
modified: 2023/12/11
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'iam.amazonaws.com'
        eventName|startswith: 
            - 'Get'
            - 'List'
    filter_1:
        userAgent: 'config.amazonaws.com'
        userIdentity.arn|endswith:
            - 'assumed-role/aws-controltower-ConfigRecorderRole/configLambdaExecution'
            - 'assumed-role/AWSServiceRoleForConfig/AWSConfig-Describe'
            - 'assumed-role/tf-tower-config-role/AWSConfig-Describe'
            - 'assumed-role/aws-controltower-ConfigRecorderRole/AWSConfig-Describe'
    filter_2:
        userAgent: 'trustedadvisor.amazonaws.com'
        userIdentity.arn|endswith: 'assumed-role/AWSServiceRoleForTrustedAdvisor/TrustedAdvisor'
    condition: selection and not (filter_1 or filter_2)
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized reads from known users/services
level: low