title: CloudTrail IAM Access Key Changes
id: fef2ca30-436a-11ea-a2b9-8d0ee3f05c35
status: stable
description: Detects IAM Access Key Changes. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/IAM/latest/APIReference/API_CreateAccessKey.html
    - https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeleteAccessKey.html
    - https://docs.aws.amazon.com/IAM/latest/APIReference/API_UpdateAccessKey.html
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/06/01
modified: 2023/07/18
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'iam.amazonaws.com'
        eventName:
            - 'CreateAccessKey'
            - 'DeleteAccessKey'
            - 'UpdateAccessKey'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Legitmate creation/modification of AccessKeys for non SSO users
level: medium