title: IAM Role Changes
id: 054e71e7-436b-11ea-9da3-aba42f01b620
status: stable
description: Detects changes to IAM roles including creation, deletion and modification. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/IAM/latest/UserGuide/id_roles.html
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/12
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'iam.amazonaws.com'
        eventName: 
          - 'CreateRole'
          - 'DeleteRole'
          - 'UpdateRole'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized changes to IAM roles from known users/services
level: medium