title: DynamoDB Information Discovery
id: fd8d467f-436a-11ea-b06b-594cfe374c77
status: stable
description: Detects information discovery of DynamoDB components. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/26
modified: 2023/12/11
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'dynamodb.amazonaws.com'
        eventName|startswith:
            - 'Describe'
            - 'List' 
    filter:
        userAgent: 'trustedadvisor.amazonaws.com'
        userIdentity.arn|endswith: 'assumed-role/AWSServiceRoleForTrustedAdvisor/TrustedAdvisor'
    condition: selection and not filter
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized reads from known users/services
level: low