title: CloudTrail IAM SAML Changes 
id: ffe3450d-436a-11ea-a446-ed0d2a1ff61a
status: stable 
description: Detects IAM SAML changes.  Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/singlesignon/latest/userguide/authconcept.html
author: Bria Atchley - SOC Analyst, F5 Inc
date: 2023/10/18
modified: 2023/12/11
logsource: 
    product: aws 
    service: cloudtrail 
detection: 
    selection: 
        eventSource: 'iam.amazonaws.com'
        eventName: 
            - 'CreateSAMLProvider'
            - 'DeleteSAMLProvider'
            - 'UpdateSAMLProvider'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized user changes in IAM 
level: low 