title: VPC ACL Changes
id: '022e6d83-436b-11ea-b0d8-b7a2e779a074'
status: stable
description: Detects changes to VPC ACLs including creation deletion and modification. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://docs.aws.amazon.com/vpc/latest/userguide/vpc-network-acls.html
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/10/24
modified: 2023/12/11
logsource:
    product: aws
    service: cloudtrail
detection:
    selection:
        eventSource: 'ec2.amazonaws.com'
        eventName: 
            - 'CreateNetworkAcl'
            - 'CreateNetworkAclEntry'
            - 'DeleteNetworkAcl'
            - 'DeleteNetworkAclEntry'
            - 'ReplaceNetworkAclAssociation'
            - 'ReplaceNetworkAclEntry'
    condition: selection
fields:
    - eventName
    - userIdentity.userName
    - userIdentity.arn
    - sourceIPAddress
    - recipientAccountId
falsepositives:
    - Authorized ACL changes from known users/services
level: medium