title: Sysmon - Powershell Initiated Connection
id: 1b8637cf-7e6c-11ea-8c41-c3739c5d4311
status: stable
description: Detects when powershell initiated an outbound network connection. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
   - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90003
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/11/07
modified: 2023/12/11
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        Image|contains: 'powershell.exe'
    condition: selection
fields:
  - User
  - Protocol
  - DestinationIp
  - DestinationPort
  - SourceIp
  - SourcePort
  - Image
falsepositives:
    - Expected and trusted outboudn connections 
level: medium