title: Outbound RDP
id: fe1f83fd-7e6b-11ea-addc-bf5302750fb8
status: stable
description: Detects outbound RDP network traffic. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
  - https://support.microsoft.com/en-us/windows/how-to-use-remote-desktop-5fe128d5-8fb1-7a23-3b8a-41e636865e8c
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90003
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/11/07
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        EventId: 3
        DestinationPort: 3389
        Initated: 'true'
    condition: selection
fields:
  - User
  - Protocol
  - DestinationIp
  - DestinationPort
  - SourceIp
  - SourcePort
  - Image
falsepositives:
    - Expected and trusted outbound connections using RDP
level: medium