title: Network Outbound HTTP
id: fee3e4db-7e6b-11ea-b74b-33082eae0e35
status: stable
description: Detects outbound HTTP network traffic. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90003
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/12/06
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationPort: 80
        Initiated: 'true'
    condition: selection
fields:
    - User
    - Protocol
    - DestinationIp
    - DestinationPort
    - SourceIp
    - SourcePort
    - Image
falsepositives:
    - Expected and trusted outbound HTTP connections
level: low