title: Sysmon - Network Connection
id: 14aab1b7-7e6c-11ea-b74b-6b2d07956464
status: stable
description: Detects all network connection events. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90003
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/11/07
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        EventId: 3
    condition: selection
fields:
  - User
  - Protocol
  - DestinationIp
  - DestinationPort
  - SourceIp
  - SourcePort
  - Image
falsepositives:
    - Expected and trusted connections
level: low