title: SSH Command to Setup SOCKS Proxy
id: 0870d2d1-57a6-11e9-80ad-eb377389d163
status: stable
description: Detects when a user sets up a SOCKS proxy using ssh. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/08/25
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith: '/ssh'
        CommandLine|contains: '-D'
    condition: selection
fields:
    - User
    - Image
    - CommandLine
falsepositives:
    - Authorized users setting up port forwarding such as to expose services
level: medium