title: System Time Changes
id: a09b22c3-2d13-11e8-9a87-d7b4ae13f1e6
status: stable
description: Detects system time changes which may indicate malicious activity, also important for log correlation. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/09/06
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        CommandLine|contains:
            - 'date -s'
            - 'date --set'
    condition: selection
fields:
    - User
    - Image
    - CommandLine
falsepositives:
    - Use of contains could cause alerts on non time adjustment related commands
    - Authorized users manually setting the time
level: low