title: Userr Privilege Escalations
id: ce4d6614-b40e-11e7-93a7-d7a84ef01ccd
status: stable
description: Detects privilege escalations using sudo and su. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/08/30
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith:
            - '/sudo'
            - '/su'
    filter:
        User: 'root'
    condition: selection and not filter
fields:
    - User
    - Image
    - CommandLine
falsepositives:
    - Privilege escalations by authorized users
level: medium