title: Docker Live Restore Disabled
id: 1750f4f1-94f5-11e8-8a7e-8556cfa0c227
status: stable
description: Detects when a Docker container does not have Live Restore enabled. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://www.tenable.com/audits/items/CIS_Docker_1.13.0_L1_v1.0.0.audit:49174f78a73edaf621d03c4465444e21
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/10/04
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith: '/docker'
    filter:
        CommandLine|contains: '--live-restore'
    condition: selection and not filter
fields:
    - Image
    - User
    - CommandLine
falsepositives:
    - Containers that do not rely on availability
level: low