title: Docker Container Has no Restrictions on Number of Forks
id: 16406fae-94f5-11e8-a7fe-971702ba5e7c
status: stable
description: Detects when the flag "--pids-limit" is not set which could lead to a fork bomb inside of a container. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://www.tenable.com/audits/items/CIS_Docker_Community_Edition_L1_Docker_v1.1.0.audit:b7207e623a13015a65101a4a00236dde
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/06/20
logsource:
    product: linux
    category: process_creation
detection:
    selection: 
        Image|endswith: '/docker'
        CommandLine|contains:
            - 'docker run'
            - 'docker container run'
    filter: 
        CommandLine|contains: '--pids-limit'
    condition: selection and not filter
fields:
    - Image
    - User
    - CommandLine
falsepositives:
level: high