title: Docker Experimental Feature Enabled in Production
id: 0e922fee-94f5-11e8-8a7e-85adcb588357
status: stable
description: Detects when experimental features are enabled in Docker which is not recommended. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    -  https://www.tenable.com/audits/items/CIS_Docker_1.13.0_L1_v1.0.0.audit:84a7fa87d05065041d21b8b405a19364
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/06/20
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith: '/dockerd'
        CommandLine|contains: '--experimental'
    condition: selection
fields:
    - Image
    - User
    - CommandLine
falsepositives:
    - Legitimate use of the experimental flag by authorized users
level: high