title: Host Data Compression or Decompression Observed
id: 28e610b8-88ac-11ea-9d17-d71dbec08434
status: stable
description: Detects common utilities to compress or decompress data. Has been observed being used in conjunction with data exfiltration. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/08/30
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith:
            - '/zip'
            - '/7z'
            - '/tar'
            - '/unzip'
            - '/gunzip'
    condition: selection
fields:
    - User
    - Image
    - CommandLine
falsepositives:
    - Authorized users and programs compressing and decompressing data such as backup activity
level: low