title: Docker Container Mount Propagation Mode Set to Shared
id: 153568a1-94f5-11e8-8a9e-c1e041856f7b
status: stable
description: Detects when the Container Mount Propagation Mode is set to shared. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://www.tenable.com/audits/items/CIS_Docker_1.13.0_L1_v1.0.0.audit:8e0c35a4645d6cba87485b729cdbdc6d
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/10/18
logsource:
    product: linux
    category: process_creation
detection:
    selection_docker:
        Image|endswith: '/docker'
        CommandLine|contains: 
            - 'docker run'
            - 'docker container run'
    selection_volume:
        CommandLine|contains:
            - '--volume'
            - '-v'
    selection_shared:
        CommandLine|contains: ':shared'
    condition: selection_docker and selection_volume and selection_shared
fields:
    - Image
    - User
    - CommandLine
falsepositives:
    - Authorized users setting the mount propagation mode to shared due to business needs. 
level: medium