title: Docker Default ulimit Override Observed
id: 156181b6-94f5-11e8-b16c-dda1a490177b
status: stable
description: Detects when the default ulimit is overridden. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://www.tenable.com/audits/items/CIS_Docker_1.13.0_L1_v1.0.0.audit:92dd45f78bd2739ee3b19080e44e0bf9
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/10/12
logsource:
    product: linux
    category: process_creation
detection:
    selection_exe:
        Image|endswith: '/docker'
    selection_run:
        CommandLine|contains:
            - 'docker run'
            - 'docker container run'
    selection_ulimit:
        CommandLine|contains:
            - '--ulimit'
    condition: selection_exe and selection_run and selection_ulimit
fields:
    - Image
    - User
    - CommandLine
falsepositives:
    - If the default ulimit settings are not appropriate for a particular container instance, you may override them as an exception.
level: medium