title: User Potentially Suspicious Command Usage
id: ce4ddb46-b40e-11e7-93a7-c5a2541977dd
status: stable
description: Detects when a potentially suspicious command is used, including the running of security tools. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/08/29
logsource:
    product: linux
    category: process_creation
detection:
    selection:
        Image|endswith:
            - '/whoami'
            - '/strace'
            - '/ifconfig'
            - '/tshark'
            - '/ptrace'
            - '/tcpdump'
            - '/nc'
            - '/ncat'
            - '/netcat'
            - '/socat'
            - '/telnet'
            - '/nmap'
            - '/dig'
            - '/traceroute'
            - '/whois'
            - '/netstat'
            - '/hping3'
            - '/tor'
            - '/stunnel'
            - '/scapy'
            - '/nemesis'
            - '/yersinia'
            - '/dsniff'
            - '/filesnarf'
            - '/mailsnarf'
            - '/msgsnarf'
            - '/urlsnarf'
            - '/webspy'
            - '/arpspoof'
            - '/dnsspoof'
            - '/macof'
            - '/sshmitm'
            - '/webmitm'
            - '/ntop'
            - '/wireshark'
            - '/ngrep'
            - '/kismet'
            - '/ettercap'
            - '/netstumbler'
            - '/etherape'
    condition: selection
fields:
    - User
    - Image
    - CommandLine
falsepositives:
    - Use of executables by authorized users
level: medium