title: Sysmon Error Occurred
id: 20d2e064-7e6c-11ea-804f-69ab0a0a4b91
status: stable
description: Detects when an error occurrs withint the sysmon subsystem. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
   - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
   - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90225
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/11/10
logsource:
    product: windows
    services: sysmon
detection:
    selection:
        EventId: 225
    condition: selection
falsepositives:
    - Errors that are the result of non-malicious and expected activity 
level: medium