title: Sysmon Service State Change
id: 17071817-7e6c-11ea-b74b-8f91f9002fc2
status: stable
description: Detects when the sysmon service is stopped or started. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
  - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
  - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?source=Sysmon&eventID=4
author: Levi Smith - SOC Analyst II, F5 Inc
date: 2023/11/10
logsource:
    product: windows
    service: sysmon 
detection:
    selection:
        EventId: 4
    condition: selection
fields:
  - State
  - Version
  - SchemaVersion
falsepositives:
    - Expected stops or starts from known users/services
level: medium