title: Registry Event Possible Image File Execution Options Injection
id: 2477ccca-7e6c-11ea-a640-d3b5a76e95a4
status: stable
description: Detects registry modifications of image file execution options which could be abused to execute malicious binaries and defense evasion. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://learn.microsoft.com/en-us/archive/blogs/mithuns/image-file-execution-options-ifeo
    - https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/11/03
tags:
    - attack.t1546.012
logsource:
    product: windows
    category: registry_event
detection:
    selection:
        TargetObject|contains:
            - 'SOFTWARE\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Image File Execution Options'
            - 'SOFTWARE\Microsoft\Windows NT\CurrentVersion\SilentProcessExit'
            - 'Software\Wow6432Node\Microsoft\Windows NT\CurrentVersion\Image File Execution Options'
            - 'Software\Microsoft\Windows NT\CurrentVersion\SilentProcessExit'
    condition: selection
fields:
    - Image
    - TargetObject
    - User
    - Details
falsepositives:
    - Authorized users modifying image execution options for debugging purposes. 
level: medium