title: Certutil Usage
id: 2856b430-7e6c-11ea-b563-9d8dc58fe296
status: stable
description: Detects the use of certutil tool which can be used to download files or obfuscate information. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certutil/
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/12/07
tags:
    - attack.t1105
    - attack.t1140
    - attack.t1553.004
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\certutil.exe'
    condition: selection
fields:
falsepositives:
    - Authorized use of certutil by authorized users
level: medium