title: Sysmon Creation of Hidden Folders or Files
id: 0b8c1978-7e6c-11ea-b74b-95dd39c9f114
status: stable
description: Detects when the attrib.exe executable is used to create hidden folders and files. Licensed under DRL v1.1, original rule copyright F5, Inc.
references:
    - https://www.mandiant.com/resources/blog/fin13-cybercriminal-mexico
author: Ethan Hansen - Security Engineer, F5 Inc
date: 2023/11/08
tags:
    - attack.t1564.001
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image: 'C:\Windows\System32\attrib.exe'
        CommandLine|contains: '-h'
    condition: selection
fields:
    - User
    - Image
    - CommandLine
falsepositives:
    - Authorized users hiding files
level: medium